feaser/openblt/Target/Source/ARMCM4_STM32/flash.c
/** \brief   Lookup table to quickly convert sector number to mask.
 *  \details The STM32F4x Standard Peripheral Library driver needs a sector mask instead
 *           of the sector number. this ROM lookup table can quickly convert the sector
 *           number to its mask.
 */
static const blt_int16u flashSectorNumToMask[] =
{
  FLASH_Sector_0,                        /* idx 0  - mask for sector 0                 */
  FLASH_Sector_1,                        /* idx 1  - mask for sector 1                 */
  FLASH_Sector_2,                        /* idx 2  - mask for sector 2                 */
  FLASH_Sector_3,                        /* idx 3  - mask for sector 3                 */
  FLASH_Sector_4,                        /* idx 4  - mask for sector 4                 */
  FLASH_Sector_5,                        /* idx 5  - mask for sector 5                 */
  FLASH_Sector_6,                        /* idx 6  - mask for sector 6                 */
  FLASH_Sector_7,                        /* idx 7  - mask for sector 7                 */
  FLASH_Sector_8,                        /* idx 8  - mask for sector 8                 */
  FLASH_Sector_9,                        /* idx 9  - mask for sector 9                 */
  FLASH_Sector_10,                       /* idx 10 - mask for sector 10                */
  FLASH_Sector_11,                       /* idx 11 - mask for sector 11                */
  FLASH_Sector_12,                       /* idx 12 - mask for sector 12                */
  FLASH_Sector_13,                       /* idx 13 - mask for sector 13                */
  FLASH_Sector_14,                       /* idx 14 - mask for sector 14                */
  FLASH_Sector_15,                       /* idx 15 - mask for sector 15                */
  FLASH_Sector_16,                       /* idx 16 - mask for sector 16                */
  FLASH_Sector_17,                       /* idx 17 - mask for sector 17                */
  FLASH_Sector_18,                       /* idx 18 - mask for sector 18                */
  FLASH_Sector_19,                       /* idx 19 - mask for sector 19                */
  FLASH_Sector_20,                       /* idx 20 - mask for sector 20                */
  FLASH_Sector_21,                       /* idx 21 - mask for sector 21                */
  FLASH_Sector_22,                       /* idx 22 - mask for sector 22                */
  FLASH_Sector_23                        /* idx 23 - mask for sector 23                */
};


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is 
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are 
 *           programmed to flash. The flash block manager requires some software 
 *           overhead, yet results is faster flash programming because data is first 
 *           harvested, ideally until there is enough to program an entire flash block, 
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

/** \brief   Local variable with information about the flash boot block.
 *  \details The first block of the user program holds the vector table, which on the 
 *           STM32 is also the where the checksum is written to. Is it likely that 
 *           the vector table is first flashed and then, at the end of the programming
 *           sequence, the checksum. This means that this flash block need to be written
 *           to twice. Normally this is not a problem with flash memory, as long as you
 *           write the same values to those bytes that are not supposed to be changed 
 *           and the locations where you do write to are still in the erased 0xFF state.
 *           Unfortunately, writing twice to flash this way, does not work reliably on 
 *           all micros. This is why we need to have an extra block, the bootblock,
 *           placed under the management of the block manager. This way is it possible 
 *           to implement functionality so that the bootblock is only written to once
 *           at the end of the programming sequence.
 */
static tFlashBlockInfo bootBlockInfo;


/************************************************************************************//**
** \brief     Initializes the flash driver. 
** \return    none.
**
****************************************************************************************/
void FlashInit(void)
{
  /* init the flash block info structs by setting the address to an invalid address */
  blockInfo.base_addr = FLASH_INVALID_ADDRESS;
  bootBlockInfo.base_addr = FLASH_INVALID_ADDRESS;
} /*** end of FlashInit ***/


/************************************************************************************//**
** \brief     Writes the data to flash through a flash block manager. Note that this
**            function also checks that no data is programmed outside the flash 
**            memory region, so the bootloader can never be overwritten.
** \param     addr Start address.
** \param     len  Length in bytes.
** \param     data Pointer to the data buffer.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise. 
**
****************************************************************************************/
blt_bool FlashWrite(blt_addr addr, blt_int32u len, blt_int8u *data)
{
  blt_addr base_addr;

